In [30]:
import pandas as pd

In [31]:
log = pd.read_csv('log.csv', sep=';')

In [39]:
log

                              user_id                  time      bet      win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN      NaN
..                                ...                   ...      ...      ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0      NaN
996                            #error                   NaN  10054.0  29265.0
997                            #error                   NaN  10454.0      NaN
998                            #error                   NaN   1000.0      NaN
999                            #error                   NaN  10754.0      NaN

[1000 rows x 4 columns]

In [40]:
log.columns = ['user_id','time','bet','win']

In [41]:
log

                              user_id                  time      bet      win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN      NaN
..                                ...                   ...      ...      ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0      NaN
996                            #error                   NaN  10054.0  29265.0
997                            #error                   NaN  10454.0      NaN
998                            #error                   NaN   1000.0      NaN
999                            #error                   NaN  10754.0      NaN

[1000 rows x 4 columns]

In [42]:
def user_number(string): 
    import re 
    string = re.findall(r'user_\d+', string)
    return ''.join(string)
log['user_id'] = log['user_id'].apply(lambda x: user_number(x))

In [43]:
log['time'] = log['time'].apply(lambda x: x if pd.isna(x) else str(x).replace('[',''))

In [12]:
log.time.isna().value_counts()

False    985
True      15
Name: time, dtype: int64

In [13]:
log2 = log.copy()

In [14]:
log2.dropna(axis=1)

      user_id
0    user_919
1    user_973
2    user_903
3    user_954
4    user_954
..        ...
995  user_984
996
997
998
999

[1000 rows x 1 columns]

In [16]:
log2.dropna(axis=0)

      user_id                 time        bet        win
14   user_917   2019-01-02 8:57:36   145732.0  1987653.0
29   user_942  2019-01-04 13:59:42  1678321.0  9876543.0
151  user_982  2019-01-16 21:54:22      100.0     4749.0
189  user_964  2019-01-21 18:34:44      200.0     4667.0
205  user_931   2019-01-22 5:26:59      300.0     4319.0
..        ...                  ...        ...        ...
967  user_975  2019-04-19 22:25:15     1000.0     6108.0
971  user_912  2019-04-20 10:35:49    10554.0    31799.0
972  user_926  2019-04-20 10:35:50    10354.0    30244.0
976  user_970  2019-04-20 10:35:54    10354.0    30691.0
991  user_965  2019-04-20 12:55:41      800.0     6927.0

[133 rows x 4 columns]

In [21]:
log2.user_id.isna().value_counts()

False    1000
Name: user_id, dtype: int64

In [20]:
log2.time.isna().value_counts()

False    985
True      15
Name: time, dtype: int64

In [26]:
log2.drop(columns=['time'])

      user_id      bet      win
0    user_919      NaN      NaN
1    user_973      NaN      NaN
2    user_903      NaN      NaN
3    user_954      NaN      NaN
4    user_954      NaN      NaN
..        ...      ...      ...
995  user_984   9754.0      NaN
996            10054.0  29265.0
997            10454.0      NaN
998             1000.0      NaN
999            10754.0      NaN

[1000 rows x 3 columns]

In [34]:
log.drop_duplicates(subset=['user_id', 'time'])

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[986 rows x 4 columns]

In [49]:
log['time']=pd.to_datetime(log['time'])

In [51]:
log['time'].max()

Timestamp('2019-04-20 18:10:07')

In [60]:
log = log.dropna()
log.time.apply(lambda x: x.minute)

14     57
29     59
151    54
189    34
205    26
       ..
967    25
971    35
972    35
976    35
991    55
Name: time, Length: 133, dtype: int64

In [61]:
## Эта функция аналогична записи 
# year_column = log['time'].apply(lambda x: x.year)

year_column = log['time'].dt.year

### Атрибуты datetime: 
Для начала вспомним, что мы можем делать с datetime. Вот примеры атрибутов, по которым мы можем обращаться к данным объектам:

<li>year: возвращает год</li>
<li>month: возвращает месяц</li>
<li>day: возвращает день</li>
<li>hour, minute, second - час, минута, секунда</li>
<li>dayofweek - день недели, от 0 до 6, где 0 - понедельник, 6 - воскресенье</li>

In [63]:
log['time'].dt.minute.value_counts().head()

36    7
57    5
44    5
18    5
35    4
Name: time, dtype: int64

In [75]:
log['time'].dt.month.value_counts()

3    57
4    51
2    16
1     9
Name: time, dtype: int64